kyungjae-lee/rtos-from-scratch/bsp/stm32f407xx_bsp/Src/stm32f407xx_led.c
/*****************************************************************************************
 * @ File name		: stm32f407xx_led.c
 * @ Description	: LED driver
 * @ Author			: Kyungjae Lee
 * @ Date created	: 04/11/2023
 ****************************************************************************************/

#include "stm32f407xx.h"

/*****************************************************************************************
 * LED driver
 *
 * 1. Identify the GPIO port LED is connected to
 * 2. Identify the bus interface the GPIO peripheral is connected to
 * 3. Enable clock for the GPIO peripheral
 * 4. Identify the GPIO pin number of the LED
 * 5. Configure corresponding pin to output mode
 * 6. Set pin bit to turn on, clear to turn off the LED
 ****************************************************************************************/

/* Initializes LEDs */
void led_init(void)
{
	/* Enable clock for GPIOD peripheral */
	RCC_AHB1ENR |= GPIODEN;

	/* Set LED pin mode to output mode */
	/* Clear */
	GPIOD_MODER &= ~(0xFFU << 24);
	/* Set */
	GPIOD_MODER |= (LED_GREEN_MODE_OUTPUT |
					LED_ORANGE_MODE_OUTPUT |
					LED_RED_MODE_OUTPUT |
					LED_BLUE_MODE_OUTPUT);
}

/*
 * Green LED
 */

void led_green_on(void)
{
	GPIOD_ODR |= LED_GREEN;
}

void led_green_off(void)
{
	GPIOD_ODR &= ~LED_GREEN;
}

void led_green_toggle(void)
{
	GPIOD_ODR ^= LED_GREEN;
}

/*
 * Orange LED
 */

void led_orange_on(void)
{
	GPIOD_ODR |= LED_ORANGE;
}

void led_orange_off(void)
{
	GPIOD_ODR &= ~LED_ORANGE;
}

void led_orange_toggle(void)
{
	GPIOD_ODR ^= LED_ORANGE;
}

/*
 * Red LED
 */

void led_red_on(void)
{
	GPIOD_ODR |= LED_RED;
}

void led_red_off(void)
{
	GPIOD_ODR &= ~LED_RED;
}

void led_red_toggle(void)
{
	GPIOD_ODR ^= LED_RED;
}

/*
 * Blue LED
 */

void led_blue_on(void)
{
	GPIOD_ODR |= LED_BLUE;
}

void led_blue_off(void)
{
	GPIOD_ODR &= ~LED_BLUE;
}

void led_blue_toggle(void)
{
	GPIOD_ODR ^= LED_BLUE;
}
